**Loading Data into a dataframe

In [14]:
import pandas as pd
file='titanic_data.csv'
titanic=pd.read_csv(file, nrows=5, header=None) #this loads the file into a data frime
print(titanic.head())

            0       1                                 2       3     4      5   \
0  PassengerId  Pclass                              Name     Sex   Age  SibSp
1          892       3                  Kelly, Mr. James    male  34.5      0
2          893       3  Wilkes, Mrs. James (Ellen Needs)  female    47      1
3          894       2         Myles, Mr. Thomas Francis    male    62      0
4          895       3                  Wirz, Mr. Albert    male    27      0

      6       7       8      9         10
0  Parch  Ticket    Fare  Cabin  Embarked
1      0  330911  7.8292    NaN         Q
2      0  363272       7    NaN         S
3      0  240276  9.6875    NaN         Q
4      0  315154  8.6625    NaN         S

In [21]:
titanic[:][titanic=='male']

    0    1    2     3    4    5    6    7    8    9    10
0  NaN  NaN  NaN   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1  NaN  NaN  NaN  male  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2  NaN  NaN  NaN   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN  male  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  male  NaN  NaN  NaN  NaN  NaN  NaN  NaN

In [16]:
titanic_array=titanic.values #this converts the pandaframe to an array
print(titanic_array)
print(type(titanic_array))

[['PassengerId' 'Pclass' 'Name' 'Sex' 'Age' 'SibSp' 'Parch' 'Ticket'
  'Fare' 'Cabin' 'Embarked']
 ['892' '3' 'Kelly, Mr. James' 'male' '34.5' '0' '0' '330911' '7.8292'
  nan 'Q']
 ['893' '3' 'Wilkes, Mrs. James (Ellen Needs)' 'female' '47' '1' '0'
  '363272' '7' nan 'S']
 ['894' '2' 'Myles, Mr. Thomas Francis' 'male' '62' '0' '0' '240276'
  '9.6875' nan 'Q']
 ['895' '3' 'Wirz, Mr. Albert' 'male' '27' '0' '0' '315154' '8.6625' nan
  'S']]
<class 'numpy.ndarray'>

data = pd.read_csv(file,                     #name of file
                   sep='\t',                 #selects the delimiter to use= \t is tab 
                   comment='#',              #this removes comments. values which begin # in this case 
                   na_values='Nothing')     #this replaces 'nothing' with NaN